// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, 
// которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

// int count = 0;
// int[] array = new int [10];

// void SetArray()
// {
// for (int i = 0; i < array.Length; i++)
//     array[i] = new Random().Next(0, 1000);

//  Console.WriteLine("Set array: [" + string.Join(", ", array) + "]");
// }

// void EvenNumbers()
// {
//     for (int i = 0; i < array.Length; i++)
//         if (array[i] % 2 == 0)
//         count++;
// }
// SetArray();
// EvenNumbers();
// Console.WriteLine(count);

// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

// [3, 7, 23, 12] -> 19

// [-4, -6, 89, 6] -> 0

// Задача 38: Задайте массив дробных чисел. Найдите разницу между максимальным и минимальным элементов массива.

// [3,5 7,78 22 2,23 78, 25] -> 76,02
